{
  "checkVatService.pas": "Resumo Curto:\n\nCódigo em Delphi 7 para consumir o serviço web \"checkVatService\", permitindo validar números de IVA de empresas da UE. Inclui suporte a timeouts, verificação de conectividade e métodos para validação direta e aproximada.",
  "DsapCode.pas": "Resumo Curto:\n\nFormulário em Delphi para entrada de códigos SAP, com validação numérica e botões para confirmar ou cancelar a operação. Utiliza componentes AlphaControls e DevExpress para estilização e funcionalidade.",
  "EcustomerAddressDoc.pas": "Resumo Curto:\n\nFormulário Delphi para gerenciar endereços e documentação de clientes, com reutilização de frames e configuração dinâmica de chaves de ligação.",
  "FRaddressContact.pas": "Resumo Curto:\n\nO código implementa uma interface de grade para gerenciar contatos associados a endereços, permitindo adicionar, editar e excluir contatos. Ele utiliza componentes modernos e integra-se a serviços SOAP para manipulação de dados.",
  "FRagentsCustomers.pas": "Resumo Curto:\n\nO `FRagentsCustomers` gerencia agentes e clientes, permitindo adicionar, editar e excluir registros. Ele utiliza uma grade para exibição de dados e integra-se a serviços SOAP para buscar informações. É uma solução eficiente para sistemas de gerenciamento de clientes.",
  "FRchanges.pas": "Resumo Curto:\n\nO `TFRAMEchanges` é um componente de grade em Delphi para gerenciar alterações de clientes, com suporte a campos ocultos, ordenação e ações de edição. Ele é configurável e extensível, mas carece de validações e mensagens de erro explícitas.",
  "FRconsBook.pas": "Resumo Curto:\n\nFormulário Delphi para gerenciar contatos e reservas, com suporte a valores dinâmicos e integração com metadados. Inclui campos para nome, telefone, e-mail e observações, além de um ComboBox para seleção de modos de reserva.",
  "FRconsDelDay.pas": "Resumo Curto:\n\nComponente Delphi para gerenciar dias de entrega de consignatários, utilizando uma grade interativa com validações e integração com serviços SOAP.",
  "FRconsMarket.pas": "Resumo Curto:\n\nFormulário para gerenciar mercados consignados, permitindo edição de código, descrição e seleção de região. Integra serviços SOAP para manipulação de dados e utiliza componentes personalizados para busca e exibição de informações.",
  "FRconsMill.pas": "Resumo Curto:\n\nComponente de grid configurável para exibir e gerenciar dados de \"Consignee Mill\", com suporte a personalização de colunas, edição e integração com propriedades específicas.",
  "FRconsRpPosit.pas": "Resumo Curto:\n\nO código implementa uma interface de grade para gerenciar dados de \"ConsigneeRpPosit\", permitindo adicionar, editar, excluir e buscar registros. Ele utiliza componentes modernos e serviços SOAP para manipulação de dados.",
  "FRconsSplDevice.pas": "Resumo Curto:\n\nO código implementa uma interface de grade para gerenciar dispositivos especiais, permitindo adicionar, editar e excluir registros. Ele utiliza serviços SOAP para validação e busca de dados, sendo parte de um sistema maior de gerenciamento de consignatários.",
  "FRconsStandardLogisticCosts.pas": "Resumo Curto:\n\nO código implementa um componente para gerenciar custos logísticos padrão, permitindo edição em grade, integração com serviços SOAP e busca de dados relacionados a métodos de envio e armazéns.",
  "FRconsVehType.pas": "Resumo Curto:\n\nO código implementa um grid interativo para gerenciar tipos de veículos, permitindo adicionar, editar e excluir registros. Ele utiliza componentes visuais avançados e comunicação SOAP para integração com serviços externos.",
  "FRcountryCal.pas": "Resumo Curto:\n\nFormulário Delphi para gerenciar eventos de países, com campos para descrição, data e seleção de país. Utiliza serviços SOAP e componentes personalizados para busca e validação de dados.",
  "FRcsaClient.pas": "Resumo Curto:\n\nO código implementa uma interface gráfica para gerenciar clientes, permitindo seleção, transferência e edição de dados. Ele utiliza componentes visuais avançados e é configurado para facilitar a manipulação de dados em um grid.",
  "FRcustAgent.pas": "Resumo Curto:\n\nO código implementa uma interface de grade para gerenciar agentes de clientes, permitindo edição, busca e validação de dados. Ele utiliza componentes visuais e bibliotecas personalizadas para oferecer uma solução eficiente e configurável.",
  "FRcustBank.pas": "Resumo Curto:\n\nO `TFRAMEcustBank` é um frame para gerenciar dados bancários de clientes, permitindo edição e busca. Ele utiliza grids configuráveis e é extensível, mas não define validações ou mensagens de erro explícitas.",
  "FRcustBia.pas": "Resumo Curto:\n\nFormulário Delphi para gerenciar dados de \"Customer Bia\", incluindo períodos, porcentagens e rebates. Permite inserção e edição de registros com valores padrão configurados automaticamente.",
  "FRcustBusinessChannel.pas": "Resumo Curto:\n\nO código gerencia uma grade de canais de negócios de clientes, permitindo exibição e validação de dados. Ele desativa a edição de campos específicos e verifica a ativação de canais no portal. É parte de um sistema maior para gerenciamento de dados de clientes.",
  "FRcustCoC.pas": "Resumo Curto:\n\nInterface em Delphi para gerenciar certificações FSC, PEFC e CW, permitindo entrada, validação e manipulação de dados. Utiliza componentes visuais avançados e lógica condicional para habilitar/desabilitar campos com base em interações do usuário.",
  "FRcustCredit.pas": "Resumo Curto:\n\nFormulário Delphi para gerenciar informações de crédito de clientes, com integração SOAP e componentes visuais para edição e visualização de dados.",
  "FRcustCrosssellBrand.pas": "Resumo Curto:\n\nO componente `TFRAMEcustCrosssellBrand` exibe uma grade para gerenciar marcas de vendas cruzadas de clientes, permitindo seleção e desmarcação em massa. Ele é configurável e pode ser integrado a diferentes formulários, mas carece de validações e mensagens de erro explícitas.",
  "FRcustIBAN.pas": "Resumo Curto:\n\nO código implementa um formulário para edição do IBAN do cliente, utilizando componentes visuais e integração com banco de dados. Ele é funcional, mas carece de validações e mensagens de erro explícitas.",
  "FRcustLists.pas": "Resumo Curto:\n\nO código `FRcustLists` implementa um formulário para gerenciar listas de clientes, integrando serviços SOAP e componentes personalizados. Ele permite configurar mercados, unidades de negócios e informações básicas da lista, mas carece de validações e mensagens de erro explícitas.",
  "FRcustListsDetail.pas": "Resumo Curto:\n\nO `FRcustListsDetail` é um frame para gerenciar listas de clientes, permitindo edição, importação e validação de dados em um grid interativo, com suporte a serviços SOAP para integração.",
  "FRcustMarket.pas": "Resumo Curto:\n\nO código implementa um formulário para gerenciar mercados de clientes, com campos vinculados a um banco de dados e integração com serviços SOAP para busca de regiões e moedas. Ele é funcional, mas carece de validações e mensagens de erro explícitas.",
  "FRcustomerAddressDoc.pas": "Resumo Curto:\n\nO código implementa um formulário para gerenciar endereços de clientes, com validações básicas e integração com serviços SOAP. Ele permite inserir, validar e exibir dados como nome, país e observações.",
  "FRcustomerCreditInfo.pas": "Resumo Curto:\n\nO `TFRAMEcustomerCreditInfo` é um componente Delphi que exibe informações financeiras de clientes, como status de envio, valores de pedidos e créditos disponíveis. Ele é configurável e utiliza componentes visuais e de dados para criar uma interface funcional e interativa.",
  "FRcustomerVAT.pas": "Resumo Curto:\n\nO `TFRAMEcustomerVAT` é um frame para gerenciar dados de VAT de clientes, exibindo informações em uma grade e permitindo ações como adicionar, editar e excluir registros. Ele utiliza componentes visuais e serviços SOAP para manipulação de dados.",
  "FRcustOrdUnits.pas": "Resumo Curto:\n\nO código implementa uma interface de grade para gerenciar unidades de pedidos de clientes, permitindo edição e busca de dados. Ele utiliza componentes visuais e integrações SOAP para manipulação de dados.",
  "FRcustProdMill.pas": "Resumo Curto:\n\nO código implementa uma grade configurável para gerenciar dados de moinhos de clientes, permitindo ajustes como colunas somente leitura, ocultação e editores personalizados. Ele é parte de um sistema maior, mas carece de validações e mensagens de erro explícitas.",
  "FRcustPulpPriceType.pas": "Resumo Curto:\n\nFormulário para gerenciar preços de polpa, permitindo configuração de tipo, data, moeda e taxa de câmbio, com integração a serviços SOAP para busca de dados.",
  "FRcustSalesAssist.pas": "Resumo Curto:\n\nEste código implementa um formulário para gerenciar dados de assistentes de vendas de clientes, permitindo exibição e edição de informações como nome, e-mail, login e CSA, com integração a um serviço de dados.",
  "FRcustSalesMan.pas": "Resumo Curto:\n\nO código implementa uma interface de grade para gerenciar vendedores, permitindo adicionar, editar e buscar dados. Ele utiliza componentes visuais avançados e bibliotecas personalizadas para facilitar a manipulação de dados.",
  "FRdocsCheck.pas": "Resumo Curto:\n\nO código implementa um formulário para edição de documentos, com integração a serviços SOAP. Ele permite configurar e manipular dados de documentos, mas carece de validações e mensagens de erro explícitas.",
  "FRdocsCheckAdditional.pas": "Resumo Curto:\n\nO código implementa um componente de grade para gerenciar dados de checklist de documentos, permitindo adição, exclusão e edição de registros com configurações personalizáveis e integração com bibliotecas visuais e personalizadas.",
  "FRdocsCheckReqTo.pas": "Resumo Curto:\n\nO `TFRAMEdocsCheckReqTo` é um componente Delphi que gerencia uma grade de dados, permitindo a seleção de registros e configuração de propriedades como campos ocultos e editores personalizados. Ele é parte de um sistema maior para manipulação de dados em interfaces gráficas.",
  "FRdocsCheckRulesCriteria.pas": "Resumo Curto:\n\nComponente Delphi para gerenciar critérios de verificação de documentos em uma grade, permitindo adicionar, editar e excluir critérios com integração a serviços externos.",
  "FRdocumentsInformation.pas": "Resumo Curto:\n\nComponente Delphi para gerenciar informações de documentos em uma grade, com validações e editores personalizados. Suporta ações de adicionar e excluir registros, configurando propriedades específicas para diferentes tipos de formulários.",
  "FRebEntityLinkOldValue.pas": "Resumo Curto:\n\nO componente `TFRAMEebEntityLinkOldValue` exibe dados estáticos relacionados à entidade `EbEntityLink`, desativando atualizações automáticas mestre/detalhe. Ele é configurado para exibição sem interatividade, sendo ideal para cenários de consulta de dados.",
  "FREpaymentLang.pas": "Resumo Curto:\n\nO componente `TFReditPaymentLang` gerencia dados de idiomas de pagamento em um grid configurável, com suporte a edição personalizada e campos somente leitura. Ele é ideal para aplicações que exigem manipulação estruturada de dados.",
  "FRextShipDel.pas": "Resumo Curto:\n\nO código implementa um formulário para gerenciar informações de pré-entrega, permitindo ativar/desativar campos dinamicamente com base em uma checkbox. Ele é integrado ao banco de dados e utiliza componentes personalizados para estilização e funcionalidade.",
  "FRextShipDelCons.pas": "Resumo Curto:\n\nO código implementa um formulário para configurar alertas de entrega, permitindo ativar/desativar alertas, definir dias/horários e e-mails de notificação. Ele utiliza componentes visuais e integração com banco de dados para gerenciar os dados.",
  "FRextShipDelConsMkt.pas": "Resumo Curto:\n\nO código implementa um formulário para gerenciar alertas de entrega prévia, permitindo configurar dias, horários e e-mails associados. Ele utiliza componentes visuais personalizados e integra-se ao banco de dados para salvar as informações.",
  "FRextShipDelCust.pas": "Resumo Curto:\n\nO código implementa um formulário para configurar alertas de entrega de clientes, permitindo ativar/desativar campos com base em uma checkbox. Ele é parte de um sistema maior de gerenciamento de entregas.",
  "FRfindCriteriaCountryCal.pas": "Resumo Curto:\n\nEste componente Delphi permite a seleção de critérios de busca por país, ano e data de evento, com inicialização automática de valores padrão e lógica condicional para habilitação de campos. Ideal para sistemas de consulta e relatórios.",
  "FRfindCriteriaEbEntityLink.pas": "Resumo Curto:\n\nO componente `TFRAMEfindCriteriaEbEntityLink` permite a seleção de critérios de busca para entidades e tipos de entidades, utilizando combos e campos de texto. Ele é parte de um sistema maior e facilita a configuração de filtros para consultas.",
  "FRfindCriteriaListCustomer.pas": "Resumo Curto:\n\nComponente Delphi para busca de clientes baseado em critérios detalhados, utilizando campos de texto, comboboxes e validações básicas. Ideal para sistemas que exigem filtros refinados e organizados.",
  "FRfindCriteriaSalesMan.pas": "Resumo Curto:\n\nComponente Delphi para definir critérios de busca por descrição e escritório, gerando filtros reutilizáveis. Inclui validação de campos e inicialização automática, sendo ideal para sistemas que requerem buscas personalizadas.",
  "FRlistAddresses.pas": "Resumo Curto:\n\nO `TFRAMElistAddresses` é um frame Delphi para gerenciar endereços e contatos, permitindo visualização, adição e edição de registros. Ele integra-se com um formulário de edição e utiliza DataSets para manipulação de dados.",
  "FRlistcontacts.pas": "Resumo Curto:\n\nO código implementa uma interface de grade para gerenciar contatos, permitindo adicionar e manipular dados. Ele utiliza componentes VCL e manipulação de dados em memória, com validações básicas e configurações de exibição.",
  "FRlistMarkets.pas": "Resumo Curto:\n\nO componente `TFRAMElistMarkets` gerencia mercados associados a agentes, permitindo busca, adição, exclusão e edição de dados. Ele utiliza um grid interativo e integra-se a serviços SOAP para manipulação de dados.",
  "FRlistPlafonds.pas": "Resumo Curto:\n\nO `FRlistPlafonds` é um componente de exibição e edição de dados em grade, com suporte a filtros e integração com serviços externos. Ele é ideal para gerenciar informações relacionadas a \"Plafonds\" de agentes.",
  "FRpaymentMill.pas": "Resumo Curto:\n\nO `TFRAMEpaymentMill` é um componente de interface gráfica para gerenciar pagamentos de fábricas, com funcionalidades de busca e integração com sistemas SAP. Ele utiliza uma grade para exibição e edição de dados, com suporte a validações e eventos personalizados.",
  "FRpaymentUsage.pas": "Resumo Curto:\n\nO `TFRAMEpaymentUsage` é um frame para exibição e manipulação de dados de uso de pagamentos em uma grade, com suporte a ações de adicionar e excluir registros, além de configurações personalizadas para colunas e editores.",
  "Global.pas": "Resumo Curto:\n\nEste código define funções e variáveis globais para manipulação de datasets, validação de dados e configuração de grids em Delphi, centralizando funcionalidades reutilizáveis para facilitar o desenvolvimento e manutenção de aplicações baseadas em banco de dados.",
  "LconsMarket.pas": "Resumo Curto:\n\nO código implementa uma interface para listar e gerenciar mercados consignados, com funcionalidades de pesquisa, exibição e ações como criar e modificar. Ele utiliza componentes personalizados e integra-se a um banco de dados para exibir informações relevantes.",
  "MaddressAndContact.pas": "Resumo Curto:\n\nFormulário para gerenciar endereços e contatos, utilizando frames para modularidade. Permite visualizar, editar e salvar dados, com suporte a relações mestre-detalhe.",
  "Main.pas": "Resumo Curto:\n\nO código define uma interface principal para gerenciar ações e menus relacionados a regiões, mercados, calendários, e outras funcionalidades. Ele utiliza componentes visuais e ações para organizar e executar essas funcionalidades de forma eficiente.",
  "MConsMarket.pas": "Resumo Curto:\n\nO código implementa um formulário para a gestão de mercados consignatários, com carregamento de dados e integração de frames personalizados. Ele é modular e extensível, mas carece de validações e mensagens de erro explícitas.",
  "FRbackAssist.pas": "Resumo Curto:\n\nO código implementa um formulário para gerenciar dados de assistentes de back-office, com validação e integração com serviços SOAP. Ele permite exibir, editar e validar informações como nome, e-mail e login, além de configurar buscas relacionadas ao back-office.",
  "FRboAssistBck.pas": "Resumo Curto:\n\nO código define um componente de grade para gerenciar registros \"BoAssistBck\", com funcionalidades de busca, validação e configuração de exibição. Ele é parte de um sistema maior, permitindo manipulação eficiente de dados em uma interface visual.",
  "LBackAssist.pas": "Resumo Curto:\n\nO código implementa uma interface para gerenciar assistentes de back office, com funcionalidades de busca, filtros e ações como criar, modificar e visualizar registros. Ele utiliza componentes visuais avançados e é extensível para atender a diferentes requisitos de negócios.",
  "MbackAssist.pas": "Resumo Curto:\n\nFormulário para gestão de assistentes de back-office, com organização em abas e integração com frames personalizados. Permite exibição e edição de dados, mas carece de validações e mensagens de erro explícitas.",
  "FRbackOffice.pas": "Resumo Curto:\n\nFormulário Delphi para gerenciar dados do \"Back Office\", com campos vinculados ao banco de dados e um componente de busca para selecionar assistentes. Utiliza serviços SOAP para comunicação e é configurado para facilitar a edição e consulta de dados.",
  "FRbackOfficeMkt.pas": "Resumo Curto:\n\nO código implementa uma interface de grade para gerenciar dados de mercado no back-office, permitindo adicionar, excluir e editar registros. Ele utiliza componentes VCL e SOAP para comunicação com serviços externos, mas carece de detalhes sobre validações e integração com APIs.",
  "LbackOffice.pas": "Resumo Curto:\n\nO código fornece uma interface para gerenciar Back Offices, permitindo ações como criar, modificar e buscar registros. Ele utiliza componentes visuais e serviços de backend para manipulação de dados, com foco em modularidade e reutilização.",
  "MbackOffice.pas": "Resumo Curto:\n\nO código gerencia uma interface de Back Office, conectando dados mestres e detalhes em um grid. Ele utiliza frames e painéis para organização, mas carece de validações e mensagens de erro explícitas.",
  "LcustSalesAssist.pas": "Resumo Curto:\n\nO código implementa uma interface para gerenciar assistentes de vendas de clientes, com funcionalidades de filtro, visualização e edição, utilizando Delphi e componentes visuais avançados.",
  "McustSalesAssist.pas": "Resumo Curto:\n\nO código implementa um formulário para gerenciar dados do assistente de vendas do cliente, utilizando frames e painéis para exibição e edição. Ele otimiza recursos com parâmetros padrão, mas carece de validações e mensagens de erro explícitas.",
  "FRsalesAssist.pas": "Resumo Curto:\n\nO código implementa um formulário para gerenciar assistentes de vendas, permitindo edição de dados e busca de escritórios. Ele utiliza serviços SOAP para manipulação de dados e componentes personalizados para busca e exibição de status.",
  "LsalesAssist.pas": "Resumo Curto:\n\nO código implementa um formulário para gerenciar assistentes de vendas, permitindo busca, criação e modificação de registros, com suporte a filtros e integração com serviços externos.",
  "MsalesAssist.pas": "Resumo Curto:\n\nO código implementa um formulário para gerenciar assistentes de vendas, permitindo edição e visualização de dados. Ele utiliza componentes visuais e bibliotecas personalizadas para criar uma interface eficiente e reutilizável.",
  "FRsalesDir.pas": "Resumo Curto:\n\nFormulário em Delphi para gerenciar \"Direção de Vendas\", com integração SOAP e exibição de status. Utiliza componentes personalizados e permite entrada de dados como descrição e direção de vendas.",
  "FRsalesDirMkt.pas": "Resumo Curto:\n\nO `TFRAMEsalesDirMkt` é um frame para gerenciar mercados de vendas, permitindo exibição, adição e exclusão de registros em uma grade configurável. Ele utiliza componentes visuais e validações básicas para garantir a integridade dos dados.",
  "LsalesDir.pas": "Resumo Curto:\n\nInterface para gerenciar direções de vendas, com funcionalidades de criação, modificação e visualização, utilizando uma grade configurável e serviços para manipulação de dados.",
  "MsalesDir.pas": "Resumo Curto:\n\nO código implementa uma interface mestre-detalhe para gerenciar direções de vendas, utilizando frames personalizados e lógica de vinculação de dados. Ele é modular, mas carece de validações e mensagens de erro explícitas.",
  "FRsalesMan.pas": "Resumo Curto:\n\nO código implementa um formulário para gerenciar vendedores, permitindo adicionar, editar e buscar informações relacionadas. Ele utiliza serviços SOAP para integração com dados externos e possui uma interface bem estruturada com componentes reutilizáveis.",
  "LsalesMan.pas": "Resumo Curto:\n\nInterface para gerenciar vendedores, com filtros por nome, escritório e status. Suporte a criação, modificação e visualização de registros, além de integração com serviços externos para manipulação de dados.",
  "MsalesMan.pas": "Resumo Curto:\n\nFormulário de gestão de vendedores com suporte para carregamento de dados e exclusão de registros, utilizando herança de classes e componentes visuais customizados.",
  "FRsalesOffices.pas": "Resumo Curto:\n\nO código implementa um formulário para gerenciar escritórios de vendas, permitindo edição de dados e busca de gerentes gerais via integração SOAP. Ele é modular, mas carece de validações explícitas e mensagens de erro detalhadas.",
  "FRsalesOfficesMkt.pas": "Resumo Curto:\n\nO código implementa uma interface para gerenciar escritórios de vendas e mercados, permitindo adicionar, excluir e buscar mercados. Ele utiliza `cxGrid` para exibição de dados e suporta ações básicas de manipulação.",
  "LsalesOffices.pas": "Resumo Curto:\n\nO código fornece uma interface para listar e gerenciar escritórios de vendas, com funcionalidades de criação, modificação e visualização. Utiliza grids para exibição de dados e herança para reutilização de componentes.",
  "MsalesOffices.pas": "Resumo Curto:\n\nO código fornece uma interface para gerenciar escritórios de vendas e mercados, utilizando frames personalizados para exibir e editar dados. Ele carece de validações explícitas e mensagens de erro, mas é modular e extensível.",
  "FRagents.pas": "Resumo Curto:\n\nO código fornece um formulário para gerenciar dados de agentes, incluindo validações, integração com serviços externos e lógica condicional para campos. Ele é parte de um sistema maior de gerenciamento de agentes.",
  "Lagents.pas": "Resumo Curto:\n\nO formulário `TFORMLagents` gerencia uma lista de agentes, permitindo busca, filtros e edição. Ele utiliza componentes visuais e serviços auxiliares para oferecer uma interface funcional e intuitiva.",
  "Magents.pas": "Resumo Curto:\n\nO formulário de gestão de agentes organiza dados em abas e utiliza frames personalizados para exibição e edição. Ele integra dados mestre-detalhe e oferece funcionalidades como impressão e manipulação de mercados.",
  "FRbankAccounts.pas": "Resumo Curto:\n\nFormulário Delphi para gerenciar contas bancárias, com integração a serviços SOAP para buscar dados de moeda, moinho e vendedor. Inclui campos para ID, nome, SWIFT e descrição.",
  "LbankAccounts.pas": "Resumo Curto:\n\nO código implementa uma interface para gerenciar contas bancárias, permitindo visualização, edição e filtragem de dados. Ele utiliza componentes personalizados e serviços externos para manipulação de dados, com foco em modularidade e usabilidade.",
  "MbankAccounts.pas": "Resumo Curto:\n\nO código implementa um formulário para gerenciar contas bancárias, permitindo carregar e exibir dados. Ele utiliza componentes personalizados e bibliotecas externas para criar uma interface gráfica funcional e eficiente.",
  "FRcarrier.pas": "Resumo Curto:\n\nO código implementa um formulário para gerenciar transportadoras, permitindo edição e integração com serviços externos. Ele utiliza componentes personalizados e validações básicas para garantir a consistência dos dados.",
  "FRcarrierAvailableVehicle.pas": "Resumo Curto:\n\nInterface para gerenciar veículos disponíveis, com grade para exibição de dados, suporte a ações de adicionar e excluir, e busca por tipo de veículo. Utiliza componentes cxGrid e serviços SOAP para comunicação.",
  "FRcarrierMill.pas": "Resumo Curto:\n\nO `FRcarrierMill` é um frame Delphi para gerenciar dados de \"Mills\" e \"Carriers\" em uma grade interativa, com suporte a validação, edição e integração com serviços SOAP.",
  "FRcarrierType.pas": "Resumo Curto:\n\nComponente Delphi para gerenciar tipos de transportadoras, permitindo exibição, edição e busca em uma grade interativa, com integração a serviços SOAP para manipulação de dados.",
  "Lcarrier.pas": "Resumo Curto:\n\nO formulário `TFORMLcarrier` gerencia transportadoras, permitindo criar, editar e pesquisar registros com filtros avançados. Ele utiliza componentes visuais e serviços externos para manipulação de dados, sendo uma solução eficiente para sistemas de gerenciamento de transportadoras.",
  "Mcarrier.pas": "Resumo Curto:\n\nO código fornece um formulário para gerenciar transportadoras, incluindo veículos, endereços, contatos e códigos SAP. Ele utiliza componentes personalizados e integrações com banco de dados para oferecer uma interface centralizada e eficiente.",
  "FRconsignee.pas": "Resumo Curto:\n\nO código define um formulário para gerenciar consignatários, com suporte a busca, validação e integração com serviços SOAP. Ele é parte de um sistema maior para manipulação de dados logísticos.",
  "FRfindCriteriaListConsignee.pas": "Resumo Curto:\n\nFormulário em Delphi para busca de consignatários, permitindo filtrar por código, descrição, país, mercado, destino, moinho, postal e status. Utiliza frames personalizados e validações básicas para garantir critérios de busca adequados.",
  "Lconsignee.pas": "Resumo Curto:\n\nO código fornece uma interface para listar e gerenciar consignatários, com suporte a filtros e ações como criar, modificar e visualizar. Ele utiliza componentes visuais e integrações com serviços para manipulação de dados.",
  "Mconsignee.pas": "Resumo Curto:\n\nInterface para manutenção de consignatários, permitindo gerenciar informações como endereços, contatos e custos logísticos. Inclui ações como duplicar e imprimir registros, com suporte a permissões e validações básicas.",
  "LcountryCal.pas": "Resumo Curto:\n\nO formulário `TFORMLcountryCal` exibe e gerencia eventos de calendário por país, permitindo filtragem, ordenação e visualização de dados. Ele utiliza componentes visuais e integra-se a serviços externos para manipulação de dados.",
  "MCountryCal.pas": "Resumo Curto:\n\nFormulário para gestão de calendários por país, permitindo busca e edição de eventos. Utiliza serviços para manipulação de dados e possui interface estruturada, mas carece de validações e mensagens de erro explícitas.",
  "FRcustomer.pas": "Resumo Curto:\n\nO código define um formulário para gerenciar dados de clientes, integrando componentes personalizados e serviços SOAP. Ele permite inserção, edição e visualização de informações, mas carece de detalhes sobre validações e integração com APIs.",
  "Lcustomer.pas": "Resumo Curto:\n\nO código implementa uma interface para gerenciar clientes, permitindo pesquisa, visualização e edição de dados. Ele utiliza componentes visuais e manipulação de dados em memória, mas carece de integração com APIs externas e validações mais robustas.",
  "Mcustomer.pas": "Resumo Curto:\n\nO formulário `TFORMMcustomer` gerencia informações de clientes, organizadas em abas para diferentes categorias. Ele permite criar, editar, duplicar e imprimir registros, com uma interface bem estruturada e componentes reutilizáveis.",
  "FRcustomerGroup.pas": "Resumo Curto:\n\nO código implementa um formulário para gerenciar grupos de clientes, permitindo edição de dados e associação de agentes via integração com serviços SOAP. Ele utiliza componentes customizados para busca e exibição de informações.",
  "FRcustomerGroupLink.pas": "Resumo Curto:\n\nO `FRcustomerGroupLink` é um componente de grade para exibição e gerenciamento de dados de grupos de clientes, com suporte para campos somente leitura, ocultos e ordenação. Ele é ideal para sistemas que necessitam de uma interface simples e configurável para visualização de dados.",
  "LcustomerGroup.pas": "Resumo Curto:\n\nO código implementa um formulário para gerenciar grupos de clientes, com funcionalidades de pesquisa, edição e visualização, utilizando componentes visuais e serviços de backend para manipulação de dados.",
  "McustomerGroup.pas": "Resumo Curto:\n\nO código implementa um formulário para gerenciar grupos de clientes e seus vínculos, utilizando frames e grids para exibição e edição de dados. Ele é funcional, mas carece de validações e mensagens de erro detalhadas.",
  "EcustLists.pas": "Resumo Curto:\n\nO formulário `TFORMEcustLists` gerencia listas de clientes com suporte a relações mestre-detalhe e validações ao alterar o mercado. Ele utiliza componentes personalizados e oferece funcionalidades básicas de edição e exclusão de dados.",
  "LcustLists.pas": "Resumo Curto:\n\nO código implementa um formulário para gerenciar listas de clientes, permitindo busca avançada e manipulação de dados. Ele utiliza componentes customizados e integra serviços externos para buscar informações de clientes e mercados.",
  "LcustMarket.pas": "Resumo Curto:\n\nO código implementa um formulário de listagem para mercados de clientes, permitindo visualização, filtragem e interação com dados. Ele utiliza componentes visuais e configurações de grid para exibir informações de forma organizada e eficiente.",
  "MCustMarket.pas": "Resumo Curto:\n\nO código implementa um formulário para gerenciar mercados de clientes, utilizando herança e componentes visuais customizados. Ele carrega dados e permite edição, mas não define validações ou mensagens de erro explícitas. É modular e reutilizável, ideal para sistemas de gestão.",
  "EdocsCheckDefaults.pas": "Resumo Curto:\n\nEste código implementa um formulário para manutenção de verificações de documentos, permitindo adicionar, excluir e imprimir documentos. Ele interage com serviços de backend para manipulação de dados e utiliza componentes personalizados para gerenciar a interface.",
  "FRdocsCheckDefaults.pas": "Resumo Curto:\n\nO código implementa um formulário para gerenciar valores padrão de checklist de documentos, com integração a serviços SOAP e componentes visuais para seleção de consignatários e mercados. Ele é parte de um sistema maior para gerenciamento de dados empresariais.",
  "FRdocsCheckDefaultsDocs.pas": "Resumo Curto:\n\nEste código implementa um grid interativo para gerenciar documentos padrão, permitindo adicionar, excluir e editar informações. Ele utiliza componentes VCL e serviços SOAP para integração com back-end, garantindo uma interface eficiente e funcional.",
  "FRdocsCheckRulesDocs.pas": "Resumo Curto:\n\nO código fornece uma interface para gerenciar documentos vinculados a regras, permitindo adicionar, excluir e configurar exibições em uma grade. Ele utiliza componentes cxGrid e bibliotecas personalizadas para oferecer funcionalidades avançadas e flexíveis.",
  "LdocsCheckListDefaults.pas": "Resumo Curto:\n\nO código implementa uma interface para gerenciar listas de verificação de documentos padrão, com funcionalidades de busca, edição e visualização. Ele utiliza grids configuráveis e componentes personalizados para facilitar a interação do usuário.",
  "EdocsCheck.pas": "Resumo Curto:\n\nO código implementa um formulário para manutenção de verificações de documentos, permitindo gerenciar documentos obrigatórios e informações adicionais. Ele utiliza frames personalizados e componentes visuais para organizar a interface e facilitar a interação do usuário.",
  "LdocsCheckList.pas": "Resumo Curto:\n\nO formulário `TFORMLdocsCheckList` exibe e gerencia listas de verificação de documentos em uma grade, com suporte a ordenação, pesquisa e integração com serviços de backend.",
  "EdocsCheckListRules.pas": "Resumo Curto:\n\nO código implementa um formulário para gerenciar regras de checklist de documentos, com abas para critérios e documentos. Ele carrega dados mestre-detalhe e permite acesso a registros inativos, utilizando componentes personalizados e de terceiros para uma interface eficiente.",
  "FRdocsCheckRules.pas": "Resumo Curto:\n\nO componente `TFRAMEdocsCheckRules` permite gerenciar regras de checklist de documentos, fornecendo uma interface para edição e integração com serviços SOAP. Ele é parte de um sistema maior para controle de documentos e unidades de negócios.",
  "LdocsCheckListRules.pas": "Resumo Curto:\n\nO código `LdocsCheckListRules` fornece uma interface para gerenciar regras de checklist de documentos, com filtros avançados e integração com serviços externos. Ele é parte de um sistema maior para facilitar a gestão de documentos corporativos.",
  "DRentities.pas": "Resumo Curto:\n\nO código implementa um formulário para entrada de código de agente e herda funcionalidades para extração de parâmetros de URL. É simples e extensível, mas carece de validações e mensagens de erro explícitas.",
  "FRebEntityLink.pas": "Resumo Curto:\n\nFormulário para gerenciar entidades, com suporte a busca, seleção de tipos e validação de dados, utilizando Delphi e serviços SOAP.",
  "FREntityAddress.pas": "Resumo Curto:\n\nFormulário modular em Delphi para gerenciar endereços de entidades, com validação básica e integração com serviços SOAP. Utiliza componentes personalizados para busca e exibição de status.",
  "FRentityComm.pas": "Resumo Curto:\n\nO código implementa uma interface para gerenciar comentários de entidades, permitindo adicionar, editar e excluir dados em uma grade. Ele utiliza componentes visuais avançados e é configurado dinamicamente com base no tipo de entidade.",
  "LebEntityLink.pas": "Resumo Curto:\n\nO código implementa uma interface para gerenciar \"EBusiness Entity Links\", permitindo visualização, exclusão e busca avançada de registros. Ele utiliza componentes visuais e serviços externos para manipulação de dados.",
  "MebEntityLink.pas": "Resumo Curto:\n\nO código gerencia um formulário para edição de vínculos de entidades de negócios, permitindo carregar, editar e salvar dados. Ele utiliza frames e serviços externos para manipulação de dados, garantindo a preservação de registros originais durante modificações.",
  "FRikam.pas": "Resumo Curto:\n\nO código implementa um formulário para gerenciar dados do sistema IKAM, com campos para nome, código, login e e-mail, além de integração com serviços externos para busca de usuários.",
  "Likam.pas": "Resumo Curto:\n\nO `TFORMLikam` é um formulário Delphi para gerenciar dados do IKAM, exibindo informações em uma grade configurável e permitindo ações como criar, modificar e buscar registros. Ele utiliza serviços de backend para carregar dados automaticamente.",
  "Mikam.pas": "Resumo Curto:\n\nO código implementa um formulário para gerenciar \"IKAMs\", utilizando frames e painéis para organizar a interface. Ele carrega dados de serviços externos e exibe informações de forma estruturada, com foco na modularidade e reutilização.",
  "FRpaymentCode.pas": "Resumo Curto:\n\nO código implementa um formulário para gerenciar códigos de pagamento, incluindo campos para desconto, datas e configurações adicionais. Ele integra serviços externos para manipulação de dados e validações básicas, mas carece de mensagens de erro e validações mais detalhadas.",
  "LpaymentCodes.pas": "Resumo Curto:\n\nO código `LpaymentCodes` implementa uma interface para gerenciar códigos de pagamento, permitindo busca, criação, modificação e visualização de registros. Ele utiliza componentes visuais e manipulação de dados em Delphi, com foco em usabilidade e organização.",
  "MPaymentCodes.pas": "Resumo Curto:\n\nO código fornece uma interface para gerenciar códigos de pagamento, com suporte a detalhes multilíngues e informações adicionais. Ele utiliza frames personalizados e componentes visuais para organizar os dados e facilitar a interação do usuário.",
  "FRregion.pas": "Resumo Curto:\n\nO código implementa um formulário para gerenciar regiões, permitindo a edição de código e descrição. Ele utiliza serviços SOAP para manipulação de dados e exibe informações de status. É uma solução simples e extensível para sistemas de cadastro.",
  "Lregion.pas": "Resumo Curto:\n\nO código implementa uma interface para gerenciar regiões, permitindo busca, edição e visualização. Ele utiliza serviços para manipulação de dados e configurações de grade para exibição eficiente.",
  "MRegion.pas": "Resumo Curto:\n\nO código define um formulário para gerenciar regiões, com carregamento de dados e exibição em um frame. Ele utiliza herança e componentes personalizados para simplificar a implementação.",
  "EsalesRegion.pas": "Resumo Curto:\n\nFormulário para gerenciar regiões de vendas, integrando dados mestre e detalhe com componentes personalizados. Permite edição e visualização de informações regionais e de marketing.",
  "FRsalesRegion.pas": "Resumo Curto:\n\nInterface para gerenciar regiões de vendas, permitindo edição de dados e seleção de gerentes regionais com integração a serviços SOAP. Utiliza componentes personalizados para busca e exibição de informações.",
  "FRsalesRegionMkt.pas": "Resumo Curto:\n\nO código implementa uma interface para gerenciar mercados associados a regiões de vendas, permitindo adicionar, excluir e visualizar mercados. Ele utiliza componentes visuais e serviços SOAP para manipulação de dados.",
  "LsalesRegion.pas": "Resumo Curto:\n\nO código fornece uma interface para gerenciar regiões de vendas, permitindo listagem, busca e edição de dados. Ele utiliza componentes visuais e integra-se a serviços externos para manipulação de dados.",
  "FRstate.pas": "Resumo Curto:\n\nFormulário para gerenciar estados, permitindo edição de descrição, código do estado e código ISO, com busca integrada de países para preenchimento automático. Utiliza serviços SOAP e componentes personalizados para manipulação de dados.",
  "Lstates.pas": "Resumo Curto:\n\nO código implementa uma interface de listagem de estados com funcionalidades de busca, visualização e edição, utilizando Delphi e componentes visuais. Ele é parte de um sistema maior para gerenciar informações geográficas.",
  "MStates.pas": "Resumo Curto:\n\nO código `MStates` implementa um formulário para a gestão de estados, permitindo carregar e editar informações com base em parâmetros fornecidos. Ele utiliza serviços externos para manipular dados e é projetado para ser reutilizável em diferentes contextos.",
  "FRwarehouse.pas": "Resumo Curto:\n\nO código implementa um formulário para gerenciar dados de armazéns, com suporte a buscas externas e validações básicas. Ele é parte de um sistema maior, integrando-se a serviços SOAP para manipulação de dados.",
  "FRwarehouseCarrier.pas": "Resumo Curto:\n\nO código implementa um frame para gerenciar transportadoras de armazéns, permitindo adicionar, excluir e buscar transportadoras. Ele utiliza componentes visuais avançados e integra-se a serviços SOAP para manipulação de dados.",
  "FRwarehouseDest.pas": "Resumo Curto:\n\nO código implementa uma interface para gerenciar destinos e métodos de envio, permitindo adicionar, editar e excluir dados em uma grade interativa. Ele utiliza componentes Delphi e serviços SOAP para comunicação com APIs externas.",
  "FRwarehouseMills.pas": "Resumo Curto:\n\nO componente `TFRAMEwarehouseMills` gerencia dados de armazéns e moinhos em uma grade, permitindo adição, exclusão e validação de registros, com suporte a integração SOAP.",
  "FRwarehouseServices.pas": "Resumo Curto:\n\nO código implementa um componente de interface gráfica para gerenciar serviços de armazém, permitindo edição em grade, pesquisa de dados e ações como adicionar e excluir serviços. Ele utiliza Delphi e componentes visuais para criar uma interface eficiente e interativa.",
  "Lwarehouse.pas": "Resumo Curto:\n\nO código implementa um formulário para listar e gerenciar armazéns, com filtros por código, nome, país e status ativo. Ele utiliza serviços externos para buscar dados e oferece uma interface funcional e extensível.",
  "Mwarehouse.pas": "Resumo Curto:\n\nFormulário para gerenciar armazéns e plataformas, com suporte a transportadoras, serviços, destinos, endereços e moinhos. Utiliza frames personalizados para modularidade e validações básicas para garantir a integridade dos dados."
}